{"https://en.wikipedia.org/wiki/--Amy_Winehouse": "\nAmy Jade Winehouse (14 September 1983 – 23 July 2011) was an English singer and songwriter. She was known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul[1][2][3] (sometimes labelled as blue-eyed soul and neo soul),[4][5] rhythm and blues,[6][7][8] and jazz.[9][10] Winehouse's debut album, Frank (2003), was a critical success in the UK and was nominated for the Mercury Prize. Her follow-up album, Back to Black (2006), led to five 2008 Grammy Awards, tying the then record for the most wins by a female artist in a single night, and made her the first British woman to win five Grammys,[11][12] including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year.\n\nWinehouse won three Ivor Novello Awards: in 2004, Best Contemporary Song for \"Stronger Than Me\"; in 2007, Best Contemporary Song again, this time for \"Rehab\"; and in 2008, Best Song Musically and Lyrically for \"Love Is a Losing Game.\" She also won the 2007 Brit Award for Best British Female Artist, having been nominated for Best British Album, with Back to Black.\n", "https://en.wikipedia.org/wiki/--Iggy_Pop": "\nJames Newell Osterberg Jr. (born April 21, 1947), known professionally by his stage name Iggy Pop (/ˈɪɡi pɒp/), and designated the \"Godfather of Punk,\"[1][2] is an American singer, songwriter, musician, producer and actor. He was the vocalist of influential proto-punk band the Stooges, who reunited in 2003,[3] and is well known for his outrageous and unpredictable stage antics.[4][5][6]\n\nIggy Pop's music has encompassed a number of styles over the course of his career, including garage rock, punk rock, hard rock, art rock, new wave, jazz and blues.[7] Though his popularity has fluctuated through the years, many of Iggy Pop's songs have become well-known, including \"Search and Destroy\" and \"I Wanna Be Your Dog\" by the Stooges, and his solo hits \"Lust for Life\", \"The Passenger\", and \"Real Wild Child (Wild One)\".\n", "https://en.wikipedia.org/wiki/--Azealia_Banks": "\nAzealia Amanda Banks (/əˈziːliə/ born May 31, 1991) is an American rapper, singer, songwriter, and actress. Raised in the Harlem neighborhood of New York City, she began releasing music through Myspace in 2008 before being signed to XL Recordings when she was 17 years old.[2] After the success of her 2012 single \"212\", Banks signed with Interscope and Polydor Records.\n\nBanks has released two mixtapes (Fantasea in 2012 and Slay-Z in 2016), one studio album (Broke with Expensive Taste in 2014), and one extended play (1991 in 2012). Her second studio album Fantasea II: The Second Wave is scheduled to be released in 2018 with the lead single \"Anna Wintour\" being released on April 6. Banks' outspoken views and controversial social media presence have been subject to media scrutiny throughout her career.\n", "https://en.wikipedia.org/wiki/--Bob_Marley_&_The_Wailers": "\nBob Marley and the Wailers was a Jamaican reggae band led by Bob Marley. It developed from the earlier ska vocal group, the Wailers, created by Marley with Peter Tosh and Bunny Wailer in 1963. By late 1963 singers Junior Braithwaite, Beverley Kelso, and Cherry Smith had joined on. By the early 1970s, Marley and Bunny Wailer had learned to play some instruments and brothers Aston \"Family Man\" Barrett (bass) and Carlton Barrett (drums), had joined the band. After Bunny Wailer and Peter Tosh left the band in 1974, Marley began touring with new band members. His new backing band included the Barrett brothers, Junior Marvin and Al Anderson on lead guitar, Tyrone Downie and Earl \"Wya\" Lindo on keyboards, and Alvin \"Seeco\" Patterson on percussion. The \"I Threes\", consisting of Judy Mowatt, Marcia Griffiths, and Marley's wife, Rita, provided backing vocals.\n\n\n", "https://en.wikipedia.org/wiki/--Lena_Horne": "\nLena Mary Calhoun Horne (June 30, 1917 – May 9, 2010) was an African American singer, dancer, actress, and civil rights activist. Horne's career spanned over 70 years appearing in film, television, and theater. Horne joined the chorus of the Cotton Club at the age of 16 and became a nightclub performer before moving to Hollywood, where she had small parts in numerous movies, and more substantial parts in the 1943 films Cabin in the Sky and Stormy Weather. Because of the Red Scare and her political activism, Horne found herself blacklisted and unable to get work in Hollywood.[2]\n\nReturning to her roots as a nightclub performer, Horne took part in the March on Washington in August 1963 and continued to work as a performer, both in nightclubs and on television while releasing well-received record albums. She announced her retirement in March 1980, but the next year starred in a one-woman show, Lena Horne: The Lady and Her Music, which ran for more than three hundred performances on Broadway. She then toured the country in the show, earning numerous awards and accolades. Horne continued recording and performing sporadically into the 1990s, disappearing from the public eye in 2000. Horne died of congestive heart failure on May 9, 2010, at the age of 92.\n"}