{"https://en.wikipedia.org/wiki/--Michael_Jackson": "\nMichael Joseph Jackson (August 29, 1958 – June 25, 2009) was an American singer, songwriter, and dancer. Dubbed the \"King of Pop\", he was one of the most popular entertainers in the world, and was the best-selling music artist during the year of his death.[1][2] Jackson's contributions to music, dance, and fashion[3][4][5] along with his publicized personal life made him a global figure in popular culture for over four decades.\n\nThe eighth child of the Jackson family, Michael made his professional debut in 1964 with his elder brothers Jackie, Tito, Jermaine, and Marlon as a member of the Jackson 5. He began his solo career in 1971 while at Motown Records. In the early 1980s, Jackson became a dominant figure in popular music. His music videos, including those of \"Beat It\", \"Billie Jean\", and \"Thriller\" from his 1982 album Thriller, are credited with breaking racial barriers and transforming the medium into an art form and promotional tool. The popularity of these videos helped bring the television channel MTV to fame. Jackson's 1987 album Bad spawned the U.S. Billboard Hot 100 number-one singles \"I Just Can't Stop Loving You\", \"Bad\", \"The Way You Make Me Feel\", \"Man in the Mirror\", and \"Dirty Diana\", becoming the first album to have five number-one singles in the nation. He continued to innovate with videos such as \"Black or White\" and \"Scream\" throughout the 1990s, and forged a reputation as a touring solo artist. Through stage and video performances, Jackson popularized a number of complicated dance techniques, such as the robot and the moonwalk, to which he gave the name. His distinctive sound and style has influenced numerous artists of various music genres.\n", "https://en.wikipedia.org/wiki/--Amy_Winehouse": "\nAmy Jade Winehouse (14 September 1983 – 23 July 2011) was an English singer and songwriter. She was known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul[1][2][3] (sometimes labelled as blue-eyed soul and neo soul),[4][5] rhythm and blues,[6][7][8] and jazz.[9][10] Winehouse's debut album, Frank (2003), was a critical success in the UK and was nominated for the Mercury Prize. Her follow-up album, Back to Black (2006), led to five 2008 Grammy Awards, tying the then record for the most wins by a female artist in a single night, and made her the first British woman to win five Grammys,[11][12] including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year.\n\nWinehouse won three Ivor Novello Awards: in 2004, Best Contemporary Song for \"Stronger Than Me\"; in 2007, Best Contemporary Song again, this time for \"Rehab\"; and in 2008, Best Song Musically and Lyrically for \"Love Is a Losing Game.\" She also won the 2007 Brit Award for Best British Female Artist, having been nominated for Best British Album, with Back to Black.\n", "https://en.wikipedia.org/wiki/--Tyler,_the_Creator": "\nTyler Gregory Okonma (born March 6, 1991), better known as Tyler, the Creator, is an American rapper, record producer, and music video director.[2][3][4][5] He rose to prominence as the leader and co-founder of the alternative hip hop collective Odd Future and has rapped on and produced songs for nearly every Odd Future release.[6] Okonma creates all the artwork for the group's releases[2] and also designs the group's clothing and other merchandise.[3]\n\nAfter releasing his debut album Goblin under XL Recordings in April 2011, Okonma signed a joint venture deal for him and his label Odd Future Records, with RED Distribution and Sony Music Entertainment.[7] Following that he released his second studio album Wolf, which was met with generally positive reviews and debuted at number three on the US Billboard 200 selling 90,000 copies in its first week.\n", "https://en.wikipedia.org/wiki/--Devin_the_Dude": "\nDevin Copeland (born June 4, 1970), better known by his stage name Devin the Dude, is an American hip hop recording artist from Houston, Texas. He is perhaps best known for his unique rapping style, his long career signed to Rap-A-Lot Records, as well as his 2002 songs \"Lacville '79\" and \"Doobie Ashtray\".\n\n\n", "https://en.wikipedia.org/wiki/--Vince_Staples": "\nVincent Jamal Staples (born July 2, 1993) is an American rapper from the Ramona Park area of North Long Beach, California.[2] He is a member of the hip hop trio Cutthroat Boyz alongside fellow Californian rappers Aston Matthews and Joey Fatts. Staples was once a close associate of Odd Future, in particular Mike G and Earl Sweatshirt. He is currently signed to Blacksmith Records, ARTium Recordings and Def Jam Recordings.\n\nStaples rose to prominence with appearances on albums by Odd Future members and his collaborative mixtape titled Stolen Youth with Mac Miller, who produced the project. In October 2014, he released his debut EP Hell Can Wait, which included the singles \"Hands Up\" and \"Blue Suede\". His debut album, Summertime '06, was released on June 30, 2015, to critical acclaim. He was also featured as a part of the XXL 2015 Freshman Class.[3] His second album Big Fish Theory incorporates avant-garde, dance and electronic influences. It was released on June 23, 2017, to further acclaim from critics.\n", "https://en.wikipedia.org/wiki/--Radiohead": "\nRadiohead are an English rock band from Abingdon, Oxfordshire, formed in 1985. The band consists of Thom Yorke (vocals, guitar, piano, keyboards), brothers Jonny Greenwood (lead guitar, keyboards, other instruments) and Colin Greenwood (bass), Ed O'Brien (guitar, backing vocals) and Philip Selway (drums, percussion). They have worked with producer Nigel Godrich and cover artist Stanley Donwood since 1994.\n\nAfter signing to EMI in 1991, Radiohead released their debut single \"Creep\" in 1992. It became a worldwide hit after the release of their debut album, Pablo Honey (1993). Their popularity and critical standing rose in the United Kingdom with the release of their second album, The Bends (1995). Radiohead's third album, OK Computer (1997), propelled them to international fame; noted for its complex production and themes of modern alienation, it is often acclaimed as a landmark record of the 1990s[1] and one of the best albums in popular music.[2][3] The group's next albums Kid A (2000) and Amnesiac (2001), recorded simultaneously, marked a dramatic change in style, incorporating influences from experimental electronic music, 20th-century classical music, krautrock, and jazz. Kid A divided listeners but was named the best album of the decade by Rolling Stone, Pitchfork and the Times.\n", "https://en.wikipedia.org/wiki/--Bruno_Mars": "\nPeter Gene Hernandez (born October 8, 1985), known professionally as Bruno Mars, is an American singer-songwriter, multi-instrumentalist, record producer, and dancer. Born and raised in Honolulu, Hawaii, by a family of musicians, Mars began making music at a young age and performed in various musical venues in his hometown throughout his childhood. He graduated from high school and moved to Los Angeles to pursue a musical career. After being dropped by Motown Records, Mars signed a recording contract with Atlantic Records in 2009.\n\nIn 2009, he co-founded the production team The Smeezingtons, responsible for the singles \"Nothin' on You\" by B.o.B and \"Billionaire\" by Travie McCoy. He featured on the hooks for both singles, becoming recognized as a solo artist. His debut studio album Doo-Wops & Hooligans (2010) included the international and U.S Billboard Hot 100 number one singles \"Just the Way You Are\" and \"Grenade\", as well as the number-four single \"The Lazy Song\". Mars' second album, Unorthodox Jukebox (2012), was number one in the United States. Its singles \"Locked Out of Heaven\" and \"When I Was Your Man\" reached number one in the US, while \"Treasure\" became a number-five single. In 2014, Mars collaborated with Mark Ronson on \"Uptown Funk\", a single which performed well on many music charts worldwide, including the US, Australia, Canada, New Zealand and UK.\n", "https://en.wikipedia.org/wiki/--Lil_Wayne": "\nDwayne Michael Carter Jr. (born September 27, 1982),[1] known professionally as Lil Wayne, is an American rapper. In 1991, at the age of nine, Lil Wayne joined Cash Money Records as the youngest member of the label, and half of the duo The B.G.'z, alongside fellow New Orleans-based rapper Lil' Doogie. In 1996, Lil Wayne joined the southern hip hop group Hot Boys, with his Cash Money label-mates Juvenile, Young Turk and Lil' Doogie (who now goes by B.G.). Hot Boys debuted with Get It How U Live!, that same year. Most of the group's success came with their platinum-selling album Guerrilla Warfare (1999) and the 1999 single \"Bling Bling\". Along with being the flagship artist of Cash Money Records, Lil Wayne is also the Chief Executive Officer (CEO) of his own label imprint, Young Money Entertainment, which he founded in 2005.\n\nLil Wayne's solo debut album Tha Block Is Hot (1999) was certified platinum by the Recording Industry Association of America (RIAA). His subsequent albums, Lights Out (2000) and 500 Degreez (2002), went on to be certified gold. Wayne reached higher popularity with his fourth album Tha Carter (2004), which was led by the single \"Go D.J.\" and his appearance on Destiny's Child's Top 10 single \"Soldier\", that same year. The album was followed by Tha Carter II (2005), as well as several mixtapes and collaborations throughout 2006 and 2007. Wayne gained more prominence with his sixth album Tha Carter III (2008), which became his most successful album to date, with first-week sales of over one million copies in the United States. The album won the Grammy Award for Best Rap Album and includes the hit singles \"Lollipop\", \"A Milli\" and \"Got Money\".\n", "https://en.wikipedia.org/wiki/--Earl_Sweatshirt": "\nThebe Neruda Kgositsile (born February 24, 1994), better known by his stage name Earl Sweatshirt, is an American rapper and record producer from Los Angeles, California son of the black nationalist poet Keorapetse Kgositsile. He originally went by the moniker Sly Tendencies in 2008, but soon changed it when Tyler, the Creator invited him to join his hip hop collective Odd Future in late 2009. He gained recognition and critical praise for his debut mixtape Earl, released in March 2010. Following its release, his mother sent him to a boarding school in Samoa until his eighteenth birthday, and he was not able to produce new music for a year and a half.\n\nAfter returning to Los Angeles in February 2012, Earl rejoined Odd Future and started producing new music. Earl released his debut studio album, Doris in August 2013. His second album, I Don't Like Shit, I Don't Go Outside: An Album by Earl Sweatshirt followed in March 2015. Both received widespread critical acclaim. He is currently signed to Columbia Records as well as his independent label Tan Cressida.\n", "https://en.wikipedia.org/wiki/--Danny_Brown": "\nDaniel Dewan Sewell (born March 16, 1981), known professionally as Danny Brown, is an American rapper. He is best known for his individuality, being described by MTV as \"one of rap's most unique figures in recent memory\".[1] In 2010, after amassing several mixtapes, Brown released his debut studio album, The Hybrid. Brown began to gain major recognition after the release of his second studio album, XXX, which received critical acclaim and earned him such accolades as Spin, as well as Metro Times \"Artist of the Year\".[2] In 2013, he entered a US Billboard chart, with the release of his third studio album, Old, which reached number 18 on the US Billboard 200 chart and spawned three singles, \"Dip\", \"25 Bucks\" and \"Smokin & Drinkin\". His fourth studio album, Atrocity Exhibition, was released on September 27, 2016.\n\n\n", "https://en.wikipedia.org/wiki/--Dave_Brubeck": "\nDavid Warren Brubeck (December 6, 1920 – December 5, 2012) was an American jazz pianist and composer, considered to be one of the foremost exponents of cool jazz. He wrote a number of jazz standards, including \"In Your Own Sweet Way\" and \"The Duke\". Brubeck's style ranged from refined to bombastic, reflecting his mother's attempts at classical training and his improvisational skills. His music is known for employing unusual time signatures, and superimposing contrasting rhythms, meters, and tonalities.\n\nHis long-time musical partner, alto saxophonist Paul Desmond, wrote the saxophone melody for the Dave Brubeck Quartet's, \"Take Five\",[1] which is in 5\n4 time and has endured as a jazz classic on one of the top-selling jazz albums, Time Out.[2] Brubeck experimented with time signatures throughout his career, recording \"Pick Up Sticks\" in 6\n4, \"Unsquare Dance\" in 7\n4, \"World's Fair\" in 13\n4, and \"Blue Rondo à la Turk\" in 9\n8. He was also a composer of orchestral and sacred music and wrote soundtracks for television, such as Mr. Broadway and the animated miniseries This Is America, Charlie Brown.\n"}