{"https://en.wikipedia.org/wiki/--Amy_Winehouse": "\nAmy Jade Winehouse (14 September 1983 – 23 July 2011) was an English singer and songwriter. She was known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul[1][2][3] (sometimes labelled as blue-eyed soul and neo soul),[4][5] rhythm and blues,[6][7][8] and jazz.[9][10] Winehouse's debut album, Frank (2003), was a critical success in the UK and was nominated for the Mercury Prize. Her follow-up album, Back to Black (2006), led to five 2008 Grammy Awards, tying the then record for the most wins by a female artist in a single night, and made her the first British woman to win five Grammys,[11][12] including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year.\n\nWinehouse won three Ivor Novello Awards: in 2004, Best Contemporary Song for \"Stronger Than Me\"; in 2007, Best Contemporary Song again, this time for \"Rehab\"; and in 2008, Best Song Musically and Lyrically for \"Love Is a Losing Game.\" She also won the 2007 Brit Award for Best British Female Artist, having been nominated for Best British Album, with Back to Black.\n", "https://en.wikipedia.org/wiki/--Charlie_Parker": "\nCharles Parker Jr. (August 29, 1920 – March 12, 1955), also known as Yardbird and Bird, was an American jazz saxophonist and composer.[1]\n\nParker was a highly influential jazz soloist and a leading figure in the development of bebop,[2] a form of jazz characterized by fast tempos, virtuosic technique and advanced harmonies. Parker was a blazingly fast virtuoso, and he introduced revolutionary harmonic ideas including rapid passing chords, new variants of altered chords, and chord substitutions. His tone ranged from clean and penetrating to sweet and somber. Parker acquired the nickname \"Yardbird\" early in his career.[3] This, and the shortened form \"Bird\", continued to be used for the rest of his life, inspiring the titles of a number of Parker compositions, such as \"Yardbird Suite\", \"Ornithology\", \"Bird Gets the Worm\", and \"Bird of Paradise\". Parker was an icon for the hipster subculture and later the Beat Generation, personifying the jazz musician as an uncompromising artist and intellectual rather than just an entertainer.[4]\n", "https://en.wikipedia.org/wiki/--Pink_Floyd": "\nPink Floyd were an English rock band formed in London in 1965. They achieved international acclaim with their progressive and psychedelic music. Distinguished by their use of philosophical lyrics, sonic experimentation, extended compositions, and elaborate live shows, they are one of the most commercially successful and influential groups in popular music history.\n\nPink Floyd were founded by students Syd Barrett on guitar and lead vocals, Nick Mason on drums, Roger Waters on bass and vocals, and Richard Wright on keyboards and vocals. They gained popularity performing in London's underground music scene during the late 1960s, and under Barrett's leadership released two charting singles and a successful debut album, The Piper at the Gates of Dawn (1967). Guitarist and vocalist David Gilmour joined in December 1967; Barrett left in April 1968 due to deteriorating mental health. Waters became the band's primary lyricist and conceptual leader, devising the concepts behind their albums The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977), The Wall (1979) and The Final Cut (1983). The Dark Side of the Moon and The Wall became two of the best-selling albums of all time.\n", "https://en.wikipedia.org/wiki/--Adele": "\nAdele Laurie Blue Adkins MBE (/əˈdɛl/; born 5 May 1988) is an English singer and songwriter. After graduating from the BRIT School for Performing Arts and Technology in 2006, Adele was given a recording contract by XL Recordings after a friend posted her demo on Myspace the same year. In 2007, she received the Brit Awards \"Critics' Choice\" award and won the BBC Sound of 2008 poll. Her debut album, 19, was released in 2008 to commercial and critical success. It is certified seven times platinum in the UK, and three times platinum in the US. The album contains her first song, \"Hometown Glory\", written when she was 16, which is based on her home suburb of West Norwood in London. An appearance she made on Saturday Night Live in late 2008 boosted her career in the US. At the 51st Grammy Awards in 2009, Adele received the awards for Best New Artist and Best Female Pop Vocal Performance.\n\nAdele released her second studio album, 21, in 2011. The album was critically well received and surpassed the success of her debut, earning numerous awards in 2012, among them a record-tying six Grammy Awards, including Album of the Year; two Brit Awards, including British Album of the Year; and three American Music Awards. The album has been certified 16 times platinum in the UK, and is overall the fourth best-selling album in the nation. In the US, it has held the top position longer than any album since 1985, and is certified diamond. The album has sold over 31 million copies worldwide. The success of 21 earned Adele numerous mentions in the Guinness Book of World Records. She was the first woman in the history of the Billboard Hot 100 to have three simultaneous top 10 singles as a lead artist, and the first female artist to simultaneously have two albums in the top five of the Billboard 200 and two singles in the top five of the Billboard Hot 100. 21 is the longest-running number one album by a female solo artist in the history of the UK and US Album Charts.\n", "https://en.wikipedia.org/wiki/--Etta_James": "\nEtta James (born Jamesetta Hawkins; January 25, 1938 – January 20, 2012) was an American singer who performed in various genres, including blues, R&B, soul, rock and roll, jazz and gospel. Starting her career in 1954, she gained fame with hits such as \"The Wallflower\", \"At Last\", \"Tell Mama\", \"Something's Got a Hold on Me\", and \"I'd Rather Go Blind\".[1] She faced a number of personal problems, including heroin addiction, severe physical abuse, and incarceration, before making a musical comeback in the late 1980s with the album Seven Year Itch.[2]\n\nJames's powerful, earthy voice bridged the gap between rhythm and blues and rock and roll. She won six Grammy Awards and 17 Blues Music Awards. She was inducted into the Rock and Roll Hall of Fame in 1993, the Blues Hall of Fame in 2001, and the Grammy Hall of Fame in 1999.[3] Rolling Stone magazine ranked James number 22 on its list of the 100 Greatest Singers of All Time; she was also ranked number 62 on its list of the 100 Greatest Artists of All Time, but was removed from that list in the 2011 \"Special Collector's Edition\" update.[4][5]\n", "https://en.wikipedia.org/wiki/--Nina_Simone": "\nNina Simone (/ˈniːnə sɪˈmoʊn/; born Eunice Kathleen Waymon; February 21, 1933 – April 21, 2003) was an American singer, songwriter, pianist, arranger, and activist in the Civil Rights Movement. Simone employed a broad range of musical styles including classical, jazz, blues, folk, R&B, gospel, and pop.\n\nBorn in North Carolina, the sixth child of a preacher, Waymon aspired to be a concert pianist.[1] With the help of a few supporters in her hometown of Tryon, North Carolina, she enrolled in the Juilliard School of Music in New York.[2]\n", "https://en.wikipedia.org/wiki/--Dizzy_Gillespie": "\nJohn Birks \"Dizzy\" Gillespie (/ɡɪˈlɛspi/; October 21, 1917 – January 6, 1993) was an American jazz trumpeter, bandleader, composer, and singer.[1]\n\nGillespie was a trumpet virtuoso and improviser, building on the virtuoso style of Roy Eldridge[2] but adding layers of harmonic complexity previously unheard in jazz. His beret and horn-rimmed spectacles, his scat singing, his bent horn, pouched cheeks and his light-hearted personality were essential in popularizing bebop.[citation needed]\n", "https://en.wikipedia.org/wiki/--Earl_Sweatshirt": "\nThebe Neruda Kgositsile (born February 24, 1994), better known by his stage name Earl Sweatshirt, is an American rapper and record producer from Los Angeles, California son of the black nationalist poet Keorapetse Kgositsile. He originally went by the moniker Sly Tendencies in 2008, but soon changed it when Tyler, the Creator invited him to join his hip hop collective Odd Future in late 2009. He gained recognition and critical praise for his debut mixtape Earl, released in March 2010. Following its release, his mother sent him to a boarding school in Samoa until his eighteenth birthday, and he was not able to produce new music for a year and a half.\n\nAfter returning to Los Angeles in February 2012, Earl rejoined Odd Future and started producing new music. Earl released his debut studio album, Doris in August 2013. His second album, I Don't Like Shit, I Don't Go Outside: An Album by Earl Sweatshirt followed in March 2015. Both received widespread critical acclaim. He is currently signed to Columbia Records as well as his independent label Tan Cressida.\n", "https://en.wikipedia.org/wiki/--Prince_Royce": "\nGeoffrey Royce Rojas (born May 11, 1989), known by his stage name Prince Royce, is an American singer and songwriter. At an early age, Royce took an interest in music, and in his teenage years began experimenting with music and writing poetry. By age nineteen, Royce met Andrés Hidalgo, who became his manager. Hidalgo later introduced Royce to Sergio George, who immediately signed him to his label after hearing three of his demos.\n\nIn March 2010, he released his eponymous debut studio album, which generated two commercially successful singles, \"Stand by Me\" and \"Corazón Sin Cara\". Both songs reached number-one on the Billboard Tropical Songs chart while \"Corazón Sin Cara\" reached number-one on the US Hot Latin Songs chart. The album itself reached number-one on the US Billboard Latin Albums and Tropical Albums charts. Royce received three awards at the Billboard Latin Music Awards in 2011, which included Tropical Album of the Year. On April 10, 2012, Royce released his second studio album, Phase II, which reached number-one on both the US Latin Albums and Tropical Albums charts. The album featured the singles \"Las Cosas Pequeñas\" and \"Incondicional\" and was nominated for the Latin Grammy Award for Best Tropical Fusion Album.\n", "https://en.wikipedia.org/wiki/--James_Brown": "\nJames Joseph Brown[1] (May 3, 1933 – December 25, 2006) was an American singer, songwriter, dancer, musician, record producer and bandleader. A progenitor of funk music and a major figure of 20th century popular music and dance, he is often referred to as the \"Godfather of Soul\".[2] In a career that lasted 50 years, he influenced the development of several music genres.[3]\n\nBrown began his career as a gospel singer in Toccoa, Georgia. He joined an R&B vocal group, the Gospel Starlighters (which later evolved into the Flames) founded by Bobby Byrd, in which he was the lead singer.[4][5] First coming to national public attention in the late 1950s as a member of the singing group The Famous Flames with the hit ballads \"Please, Please, Please\" and \"Try Me\", Brown built a reputation as a tireless live performer with the Famous Flames and his backing band, sometimes known as the James Brown Band or the James Brown Orchestra. His success peaked in the 1960s with the live album Live at the Apollo and hit singles such as \"Papa's Got a Brand New Bag\", \"I Got You (I Feel Good)\" and \"It's a Man's Man's Man's World\". During the late 1960s he moved from a continuum of blues and gospel-based forms and styles to a profoundly \"Africanized\" approach to music-making that influenced the development of funk music.[6] By the early 1970s, Brown had fully established the funk sound after the formation of the J.B.s with records such as \"Get Up (I Feel Like Being a) Sex Machine\" and \"The Payback\". He also became noted for songs of social commentary, including the 1968 hit \"Say It Loud – I'm Black and I'm Proud\". Brown continued to perform and record until his death from pneumonia in 2006.\n", "https://en.wikipedia.org/wiki/--Art_Blakey_&_The_Jazz_Messengers": "\nArthur \"Art\" Blakey (October 11, 1919 – October 16, 1990) was an American jazz drummer and bandleader. He was known as Abdullah Ibn Buhaina after he became a Muslim.[1]\n\nBlakey made a name for himself in the 1940s in the big bands of Fletcher Henderson and Billy Eckstine. He worked with bebop musicians Thelonious Monk, Charlie Parker and Dizzy Gillespie. In the mid-1950s Horace Silver and Blakey formed the Jazz Messengers, a group that the drummer was associated with for the next 35 years. The group was formed as a collective of contemporaries, but over the years the band became known as an incubator for young talent, including Freddie Hubbard, Wayne Shorter, Lee Morgan, Benny Golson, and Wynton Marsalis. The Biographical Encyclopedia of Jazz calls the Jazz Messengers \"the archetypal hard bop group of the late 50s\".[2]\n", "https://en.wikipedia.org/wiki/--Janis_Joplin": "\nJanis Lyn Joplin (/ˈdʒɒplɪn/; January 19, 1943 – October 4, 1970) was an American rock singer and songwriter; one of the most successful and widely-known female rock stars of her era.[1][2][3] After releasing three albums, she died of a heroin overdose at the age of 27. A fourth album, Pearl, was released in January 1971, just over three months after her death. It reached number one on the Billboard charts.\n\nIn 1967, Joplin rose to fame during an appearance at Monterey Pop Festival, where she was the lead singer of the then little-known San Francisco psychedelic rock band Big Brother and the Holding Company.[4][5][6] After releasing two albums with the band, she left Big Brother to continue as a solo artist with her own backing groups, first the Kozmic Blues Band and then the Full Tilt Boogie Band. She appeared at the Woodstock festival and the Festival Express train tour. Five singles by Joplin went into the Billboard Hot 100, including a cover of the song \"Me and Bobby McGee\", which reached number 1 in March 1971.[7] Her most popular songs include her cover versions of \"Piece of My Heart\", \"Cry Baby\", \"Down on Me\", \"Ball and Chain\", and \"Summertime\"; and her original song \"Mercedes Benz\", her final recording.[8][9]\n", "https://en.wikipedia.org/wiki/--Iggy_Pop": "\nJames Newell Osterberg Jr. (born April 21, 1947), known professionally by his stage name Iggy Pop (/ˈɪɡi pɒp/), and designated the \"Godfather of Punk,\"[1][2] is an American singer, songwriter, musician, producer and actor. He was the vocalist of influential proto-punk band the Stooges, who reunited in 2003,[3] and is well known for his outrageous and unpredictable stage antics.[4][5][6]\n\nIggy Pop's music has encompassed a number of styles over the course of his career, including garage rock, punk rock, hard rock, art rock, new wave, jazz and blues.[7] Though his popularity has fluctuated through the years, many of Iggy Pop's songs have become well-known, including \"Search and Destroy\" and \"I Wanna Be Your Dog\" by the Stooges, and his solo hits \"Lust for Life\", \"The Passenger\", and \"Real Wild Child (Wild One)\".\n", "https://en.wikipedia.org/wiki/--Lena_Horne": "\nLena Mary Calhoun Horne (June 30, 1917 – May 9, 2010) was an African American singer, dancer, actress, and civil rights activist. Horne's career spanned over 70 years appearing in film, television, and theater. Horne joined the chorus of the Cotton Club at the age of 16 and became a nightclub performer before moving to Hollywood, where she had small parts in numerous movies, and more substantial parts in the 1943 films Cabin in the Sky and Stormy Weather. Because of the Red Scare and her political activism, Horne found herself blacklisted and unable to get work in Hollywood.[2]\n\nReturning to her roots as a nightclub performer, Horne took part in the March on Washington in August 1963 and continued to work as a performer, both in nightclubs and on television while releasing well-received record albums. She announced her retirement in March 1980, but the next year starred in a one-woman show, Lena Horne: The Lady and Her Music, which ran for more than three hundred performances on Broadway. She then toured the country in the show, earning numerous awards and accolades. Horne continued recording and performing sporadically into the 1990s, disappearing from the public eye in 2000. Horne died of congestive heart failure on May 9, 2010, at the age of 92.\n"}