{"https://en.wikipedia.org/wiki/--Iggy_Pop": "\nJames Newell Osterberg Jr. (born April 21, 1947), known professionally by his stage name Iggy Pop (/ˈɪɡi pɒp/), and designated the \"Godfather of Punk,\"[1][2] is an American singer, songwriter, musician, producer and actor. He was the vocalist of influential proto-punk band the Stooges, who reunited in 2003,[3] and is well known for his outrageous and unpredictable stage antics.[4][5][6]\n\nIggy Pop's music has encompassed a number of styles over the course of his career, including garage rock, punk rock, hard rock, art rock, new wave, jazz and blues.[7] Though his popularity has fluctuated through the years, many of Iggy Pop's songs have become well-known, including \"Search and Destroy\" and \"I Wanna Be Your Dog\" by the Stooges, and his solo hits \"Lust for Life\", \"The Passenger\", and \"Real Wild Child (Wild One)\".\n", "https://en.wikipedia.org/wiki/--Amy_Winehouse": "\nAmy Jade Winehouse (14 September 1983 – 23 July 2011) was an English singer and songwriter. She was known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul[1][2][3] (sometimes labelled as blue-eyed soul and neo soul),[4][5] rhythm and blues,[6][7][8] and jazz.[9][10] Winehouse's debut album, Frank (2003), was a critical success in the UK and was nominated for the Mercury Prize. Her follow-up album, Back to Black (2006), led to five 2008 Grammy Awards, tying the then record for the most wins by a female artist in a single night, and made her the first British woman to win five Grammys,[11][12] including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year.\n\nWinehouse won three Ivor Novello Awards: in 2004, Best Contemporary Song for \"Stronger Than Me\"; in 2007, Best Contemporary Song again, this time for \"Rehab\"; and in 2008, Best Song Musically and Lyrically for \"Love Is a Losing Game.\" She also won the 2007 Brit Award for Best British Female Artist, having been nominated for Best British Album, with Back to Black.\n"}