{"https://en.wikipedia.org/wiki/--Amy_Winehouse": "\nAmy Jade Winehouse (14 September 1983 – 23 July 2011) was an English singer and songwriter. She was known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul[1][2][3] (sometimes labelled as blue-eyed soul and neo soul),[4][5] rhythm and blues,[6][7][8] and jazz.[9][10] Winehouse's debut album, Frank (2003), was a critical success in the UK and was nominated for the Mercury Prize. Her follow-up album, Back to Black (2006), led to five 2008 Grammy Awards, tying the then record for the most wins by a female artist in a single night, and made her the first British woman to win five Grammys,[11][12] including three of the General Field \"Big Four\" Grammy Awards: Best New Artist, Record of the Year and Song of the Year.\n\nWinehouse won three Ivor Novello Awards: in 2004, Best Contemporary Song for \"Stronger Than Me\"; in 2007, Best Contemporary Song again, this time for \"Rehab\"; and in 2008, Best Song Musically and Lyrically for \"Love Is a Losing Game.\" She also won the 2007 Brit Award for Best British Female Artist, having been nominated for Best British Album, with Back to Black.\n", "https://en.wikipedia.org/wiki/--Iggy_Pop": "\nJames Newell Osterberg Jr. (born April 21, 1947), known professionally by his stage name Iggy Pop (/ˈɪɡi pɒp/), and designated the \"Godfather of Punk,\"[1][2] is an American singer, songwriter, musician, producer and actor. He was the vocalist of influential proto-punk band the Stooges, who reunited in 2003,[3] and is well known for his outrageous and unpredictable stage antics.[4][5][6]\n\nIggy Pop's music has encompassed a number of styles over the course of his career, including garage rock, punk rock, hard rock, art rock, new wave, jazz and blues.[7] Though his popularity has fluctuated through the years, many of Iggy Pop's songs have become well-known, including \"Search and Destroy\" and \"I Wanna Be Your Dog\" by the Stooges, and his solo hits \"Lust for Life\", \"The Passenger\", and \"Real Wild Child (Wild One)\".\n", "https://en.wikipedia.org/wiki/--Janis_Joplin": "\nJanis Lyn Joplin (/ˈdʒɒplɪn/; January 19, 1943 – October 4, 1970) was an American rock singer and songwriter; one of the most successful and widely-known female rock stars of her era.[1][2][3] After releasing three albums, she died of a heroin overdose at the age of 27. A fourth album, Pearl, was released in January 1971, just over three months after her death. It reached number one on the Billboard charts.\n\nIn 1967, Joplin rose to fame during an appearance at Monterey Pop Festival, where she was the lead singer of the then little-known San Francisco psychedelic rock band Big Brother and the Holding Company.[4][5][6] After releasing two albums with the band, she left Big Brother to continue as a solo artist with her own backing groups, first the Kozmic Blues Band and then the Full Tilt Boogie Band. She appeared at the Woodstock festival and the Festival Express train tour. Five singles by Joplin went into the Billboard Hot 100, including a cover of the song \"Me and Bobby McGee\", which reached number 1 in March 1971.[7] Her most popular songs include her cover versions of \"Piece of My Heart\", \"Cry Baby\", \"Down on Me\", \"Ball and Chain\", and \"Summertime\"; and her original song \"Mercedes Benz\", her final recording.[8][9]\n"}